Revit 2024 API
ConceptualConstructionRoofType Enumeration
 ConceptualConstructionType values for Roofs.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum ConceptualConstructionRoofType
Visual Basic
Public Enumeration ConceptualConstructionRoofType
Visual C++
public enum class ConceptualConstructionRoofType
Members
Member name | Description
InvalidRoofTypeConstruction |  Invalid value/not set Roof Type Construction value
HighInsulationCoolRoof |  High Insulation Cool Roof
HighInsulationDarkRoof |  High Insulation Dark Roof
TypicalInsulationCoolRoof |  Typical Insulation Cool Roof
TypicalInsulationDarkRoof |  Typical Insulation Dark Roof
LowInsulationCoolRoof |  Low Insulation Cool Roof
LowInsulationDarkRoof |  Low Insulation Dark Roof
NoInsulationDarkRoof |  No Insulation Dark Roof
NumRoofTypeConstruction |  Total Number of Roof Type Constructions
See Also
Autodesk.Revit.DB.Analysis Namespace